# ElementId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCConnectedWallData..::..ElementId Property
IFCConnectedWallData Class See Also
---
The element id to which this element is joined.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId ElementId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ElementId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
```

# See Also
IFCConnectedWallData Class
Autodesk.Revit.DB.IFC Namespace